spec/vcr/Errors/should_raise_a_422_error_when_trying_to_make_a_payment_with_an_expired_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://<key>:@test-api.pin.net.au/1/charges
    body:
      encoding: UTF-8
      string: email=dNitza%40gmail.com&description=A%20new%20charge%20from%20testing%20Pin%20gem&amount=400&currency=AUD&ip_address=127.0.0.1&card[number]=5520000000000000&card[expiry_month]=05&card[expiry_year]=2012&card[cvc]=123&card[name]=Roland%20Robot&card[address_line1]=42%20Sevenoaks%20St&card[address_city]=Lathlain&card[address_postcode]=6454&card[address_state]=WA&card[address_country]=Australia
    headers: {}
  response:
    status:
      code: 422
      message: Unprocessable Entity
    headers:
      Cache-Control:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Mon, 08 Jul 2013 15:51:08 GMT
      Server:
      - Apache/2.2.20 (Ubuntu)
      Status:
      - '422'
      Strict-Transport-Security:
      - max-age=31536000
      Vary:
      - User-Agent
      X-Powered-By:
      - Phusion Passenger (mod_rails/mod_rack) 3.0.11
      X-Rack-Cache:
      - invalidate, pass
      X-Request-Id:
      - 6af8e4ddd1fa56f812e315639cd89d72
      X-Runtime:
      - '0.033541'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Content-Length:
      - '211'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"error":"invalid_resource","error_description":"One or more parameters
        were missing or invalid.","messages":[{"param":"card.expiry_year","code":"card_expiry_year_invalid","message":"Card
        expiry year expired"}]}'
    http_version: 
  recorded_at: Mon, 08 Jul 2013 15:51:12 GMT
recorded_with: VCR 2.5.0
